// Lab2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include "pch.h"
#include "Sequence.hpp"
#include "ArraySequence.hpp"
#include <iostream>
#include"DynamicArray.hpp"
//#include"DynamicArray2.hpp"

int main()
{

	Sequence<int>* seq = new ArraySequence<int>(5);
	Sequence<int>* seq2 = new ArraySequence<int>();
	std::printf("sdsdsdsd");


    int steck[20];
    int i = -1;  // объявили стек
    for (int j = 0; j < 6; j++) {
        int a; cin >> a;
        cin >> a;
        i++;  // увеличиваем i на один
        steck[i] = a;  // добавляем в стек элемент
    }
    if (i == -1) cout << "Стек пуст";  // проверяем пуст ли стек (нет)
    cout << steck[i] << " это верхний элемент стека";
    cout << "Сейчас мы удалим верхний элемент";
    i--;  // уменьшаем i на один
    system("pause");
    return 0;


}
//https://prog-cpp.ru/category/cpp-posts/
// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
